Revit 2027 API
ComponentRepeaterFailures Properties
The BuiltInFailures.ComponentRepeaterFailures type exposes the following members.
Properties
Name | Description
ComponentRepeater_InvalidFamilyOnReload |  Reloaded family not appropriate for repeater.
ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater |  There is only one component in this repeater.
Top
See Also
Reference
BuiltInFailures.ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace